tap "buo/cask-upgrade"
brew "atuin"
brew "bash"
brew "bat"
brew "btop"
brew "certifi"
brew "commitizen"
brew "coreutils"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fileicon"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "jq"
brew "less"
brew "llm"
brew "lua"
brew "mycli"
brew "mysql"
brew "neovim"
brew "node"
brew "pam-reattach"
brew "pandoc"
brew "perl"
brew "pkgconf"
brew "powerlevel10k"
brew "protobuf"
brew "rainfrog"
brew "rename"
brew "ripgrep"
brew "starship"
brew "switchaudio-osx"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "tree"
brew "uv"
brew "wget"
brew "yazi"
brew "z.lua"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alfred"
cask "alt-tab"
cask "figma"
cask "font-comic-shanns-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "minecraft"
cask "postman"
cask "skim"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
